package M2023_10;

/**
 * 주석명 작성일자, 버전, 작성자, 작성목적, 그밖의 프로그램 내의 부분적인 요소들에 대한 설명이 필요할때 사용한다.
 * @author PigYoung90
 * **두개는 자바 Doc형태이다. 
 * * 한개는 다중문을 뜻한다.
 */
public class D_1031Commit {
//public은 자바 예약어로써, 해당 클래스를 외부에도 공개한다.라고한다. 
// 자바 애플리케이션은 바이트 코드로 번역된 후에 바로 실행할 수 있는 일반 프로그램이다.
// {} 블록의 시작과 끝이 선언되어야 하며 해당 블록안에하나의 단위 및 문장의 집합이다.
// ; 세미콜론을 통해 각 문장을 실행하며, 문장의 끝을 의미한다. 
// 프로그램에서 입출력은 java.io패키지를 통해 입출력 프로그램을 구한한다. 
public static void main(String[] args) {
	// 예시로
	System.out.println();
	// 시스템에서 출력 프린트라인 이라는 뜻이다.
	//식별자 규칙 A-Z, a-z, _.$ 예약어를 사용할 수있으나, 예약어만 사용하면 안됨.
	//관례상 클래스 이름의 시작은 대문자, 상수 대문자, 메서드 소문자
	/*
	 * 예약어 시스템에서 일정특성을 가진 언어로 등록된 것으로 데이터 타입이나 프로그램 정의를 위해 사용된다.
	 * 자바의 모든 예약어는 
	 */
}
}
